; domain
(define (domain alfred-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :conditional-effects :existential-preconditions :constraints :action-costs)
 (:types
    receptacletype objecttype checkable - object
    agent location receptacle obj - checkable
 )
 (:constants
   sinkbasintype fridgetype microwavetype - receptacletype
   butterknifetype knifetype - objecttype
 )
 (:predicates (atlocation ?a - agent ?l - location) (receptacleatlocation ?r - receptacle ?l - location) (objectatlocation ?o - obj ?l - location) (openable ?r - receptacle) (opened ?r - receptacle) (inreceptacle ?o - obj ?r - receptacle) (isreceptacleobject ?o - obj) (inreceptacleobject ?innerobject - obj ?outobject - obj) (isreceptacleobjectfull ?o - obj) (wasinreceptacle ?o - obj ?r - receptacle) (checked ?c - checkable) (examined ?l - location) (receptacletype_0 ?r - receptacle ?rt - receptacletype) (cancontain ?rt - receptacletype ?ot - objecttype) (objecttype_0 ?o - obj ?t - objecttype) (holds ?a - agent ?o - obj) (holdsany ?a - agent) (holdsanyreceptacleobject ?a - agent) (full ?r - receptacle) (isclean ?o - obj) (cleanable ?o - obj) (ishot ?o - obj) (heatable ?o - obj) (iscool ?o - obj) (coolable ?o - obj) (pickupable ?o - obj) (moveable ?o - obj) (toggleable ?o - obj) (ison ?o - obj) (istoggled ?o - obj) (sliceable ?o - obj) (issliced ?o - obj))
 (:functions (total-cost))
 (:action look
  :parameters ( ?a - agent ?l - location)
  :precondition (and (atlocation ?a ?l))
  :effect (and (checked ?l) (increase (total-cost) 1)))
 (:action inventory
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
 (:action examinereceptacle
  :parameters ( ?a - agent ?r - receptacle)
  :precondition (and (exists (?l_0 - location)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r ?l_0))))
  :effect (and (checked ?r) (increase (total-cost) 1)))
 (:action examineobject
  :parameters ( ?a - agent ?o - obj)
  :precondition (and (or (exists (?l_0 - location)
 (exists (?r_0 - receptacle)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r_0 ?l_0) (inreceptacle ?o ?r_0) (or (not (openable ?r_0)) (opened ?r_0))))) (holds ?a ?o)))
  :effect (and (checked ?o) (increase (total-cost) 1)))
 (:action gotolocation
  :parameters ( ?a - agent ?lstart - location ?lend - location)
  :precondition (and (atlocation ?a ?lstart))
  :effect (and (not (atlocation ?a ?lstart)) (atlocation ?a ?lend) (increase (total-cost) 1)))
 (:action openobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (not (opened ?r)))
  :effect (and (opened ?r) (checked ?r) (increase (total-cost) 1)))
 (:action closeobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (opened ?r))
  :effect (and (not (opened ?r)) (increase (total-cost) 1)))
 (:action pickupobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (pickupable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r) (not (holdsany ?a)) (or (not (openable ?r)) (opened ?r)))
  :effect (and (not (inreceptacle ?o ?r)) (holds ?a ?o) (holdsany ?a) (not (objectatlocation ?o ?l)) (increase (total-cost) 1)))
 (:action putobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle ?ot - objecttype ?rt - receptacletype)
  :precondition (and (holds ?a ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (or (not (openable ?r)) (opened ?r)) (objecttype_0 ?o ?ot) (receptacletype_0 ?r ?rt) (cancontain ?rt ?ot))
  :effect (and (inreceptacle ?o ?r) (objectatlocation ?o ?l) (not (holds ?a ?o)) (not (holdsany ?a)) (increase (total-cost) 1)))
 (:action cleanobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (cleanable ?o) (receptacletype_0 ?r sinkbasintype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (isclean ?o) (increase (total-cost) 1)))
 (:action heatobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (heatable ?o) (receptacletype_0 ?r microwavetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (ishot ?o) (not (iscool ?o)) (increase (total-cost) 1)))
 (:action coolobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (coolable ?o) (receptacletype_0 ?r fridgetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (iscool ?o) (not (ishot ?o)) (increase (total-cost) 1)))
 (:action toggleobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (toggleable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r))
  :effect (and (when (ison ?o) (not (ison ?o))) (when (not (ison ?o)) (ison ?o)) (istoggled ?o) (increase (total-cost) 1)))
 (:action sliceobject
  :parameters ( ?a - agent ?l - location ?co - obj ?ko - obj)
  :precondition (and (sliceable ?co) (or (objecttype_0 ?ko knifetype) (objecttype_0 ?ko butterknifetype)) (atlocation ?a ?l) (objectatlocation ?co ?l) (holds ?a ?ko))
  :effect (and (issliced ?co) (increase (total-cost) 1)))
 (:action help
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
)

; problem
(define (problem alfred-problem)
 (:domain alfred-domain)
 (:objects
   dressertype countertoptype sofatype coffeemachinetype coffeetabletype - receptacletype
   soapbottletype tissueboxtype dishspongetype ladletype boxtype - objecttype
   agent1 - agent
   location1 location2 location3 location4 location5 - location
   dresser_1 countertop_2 sofa_3 coffeemachine_4 coffeetable_5 microwave_6 fridge_7 - receptacle
   soapbottle_1 tissuebox_2 dishsponge_3 ladle_4 box_5 - obj
 )
 (:init (receptacletype_0 dresser_1 dressertype) (receptacletype_0 countertop_2 countertoptype) (receptacletype_0 sofa_3 sofatype) (receptacletype_0 coffeemachine_4 coffeemachinetype) (receptacletype_0 coffeetable_5 coffeetabletype) (receptacletype_0 microwave_6 microwavetype) (receptacletype_0 fridge_7 fridgetype) (objecttype_0 soapbottle_1 soapbottletype) (objecttype_0 tissuebox_2 tissueboxtype) (objecttype_0 dishsponge_3 dishspongetype) (objecttype_0 ladle_4 ladletype) (objecttype_0 box_5 boxtype) (cancontain dressertype tissueboxtype) (cancontain dressertype boxtype) (cancontain countertoptype soapbottletype) (cancontain countertoptype tissueboxtype) (cancontain countertoptype dishspongetype) (cancontain countertoptype ladletype) (cancontain countertoptype boxtype) (cancontain sofatype boxtype) (cancontain coffeetabletype soapbottletype) (cancontain coffeetabletype tissueboxtype) (cancontain coffeetabletype dishspongetype) (cancontain coffeetabletype ladletype) (cancontain coffeetabletype boxtype) (pickupable soapbottle_1) (pickupable tissuebox_2) (pickupable dishsponge_3) (cleanable dishsponge_3) (pickupable ladle_4) (cleanable ladle_4) (pickupable box_5) (isreceptacleobject box_5) (receptacleatlocation dresser_1 location1) (receptacleatlocation countertop_2 location1) (receptacleatlocation sofa_3 location4) (receptacleatlocation coffeemachine_4 location5) (receptacleatlocation coffeetable_5 location4) (receptacleatlocation microwave_6 location3) (receptacleatlocation fridge_7 location1) (inreceptacle soapbottle_1 countertop_2) (inreceptacle tissuebox_2 countertop_2) (inreceptacle dishsponge_3 coffeetable_5) (inreceptacle ladle_4 coffeetable_5) (inreceptacle box_5 countertop_2) (objectatlocation soapbottle_1 location1) (objectatlocation tissuebox_2 location1) (objectatlocation dishsponge_3 location4) (objectatlocation ladle_4 location4) (objectatlocation box_5 location1) (atlocation agent1 location4) (= (total-cost) 0))
 (:goal (and (exists (?r_0 - receptacle)
 (exists (?o_0 - obj)
 (and (inreceptacle ?o_0 ?r_0) (objecttype_0 ?o_0 soapbottletype) (receptacletype_0 ?r_0 coffeetabletype))))))
 (:constraints (sometime (atlocation agent1 location1)) (sometime-after (atlocation agent1 location1) (checked dishsponge_3)) (sometime (holds agent1 soapbottle_1)) (sometime-before (holds agent1 soapbottle_1) (checked microwave_6)) (sometime (objectatlocation soapbottle_1 location4)) (sometime-before (objectatlocation soapbottle_1 location4) (or (objectatlocation dishsponge_3 location3) (holds agent1 dishsponge_3))) (sometime (checked location5)) (sometime (or (checked ladle_4) (atlocation agent1 location3))) (sometime (or (atlocation agent1 location3) (holds agent1 box_5))) (sometime (or (checked tissuebox_2) (objectatlocation box_5 location2))))
 (:metric minimize (total-cost))
)

; plan
1. (pickupobject agent1 location4 dishsponge_3 coffeetable_5)
   deleted: (inreceptacle dishsponge_3 coffeetable_5) (objectatlocation dishsponge_3 location4)
   added: (holds agent1 dishsponge_3) (holdsany agent1)
   goals met: 0 of 1
2. (gotolocation agent1 location4 location5)
   deleted: (atlocation agent1 location4)
   added: (atlocation agent1 location5)
   goals met: 0 of 1
3. (look agent1 location5)
   added: (checked location5)
   goals met: 0 of 1
4. (gotolocation agent1 location5 location3)
   deleted: (atlocation agent1 location5)
   added: (atlocation agent1 location3)
   goals met: 0 of 1
5. (examinereceptacle agent1 microwave_6)
   added: (checked microwave_6)
   goals met: 0 of 1
6. (gotolocation agent1 location3 location1)
   deleted: (atlocation agent1 location3)
   added: (atlocation agent1 location1)
   goals met: 0 of 1
7. (putobject agent1 location1 dishsponge_3 countertop_2 dishspongetype countertoptype)
   deleted: (holds agent1 dishsponge_3) (holdsany agent1)
   added: (inreceptacle dishsponge_3 countertop_2) (objectatlocation dishsponge_3 location1)
   goals met: 0 of 1
8. (pickupobject agent1 location1 soapbottle_1 countertop_2)
   deleted: (inreceptacle soapbottle_1 countertop_2) (objectatlocation soapbottle_1 location1)
   added: (holds agent1 soapbottle_1) (holdsany agent1)
   goals met: 0 of 1
9. (examineobject agent1 tissuebox_2)
   added: (checked tissuebox_2)
   goals met: 0 of 1
10. (examineobject agent1 dishsponge_3)
   added: (checked dishsponge_3)
   goals met: 0 of 1
11. (gotolocation agent1 location1 location4)
   deleted: (atlocation agent1 location1)
   added: (atlocation agent1 location4)
   goals met: 0 of 1
12. (putobject agent1 location4 soapbottle_1 coffeetable_5 soapbottletype coffeetabletype)
   deleted: (holds agent1 soapbottle_1) (holdsany agent1)
   added: (inreceptacle soapbottle_1 coffeetable_5) (objectatlocation soapbottle_1 location4)
   goals met: 1 of 1
